Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH01/atdf/PIC32CM5164JH01100.atdf
        <register name="EVCTRL" offset="0x6" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="EVACT" caption="Event Action" mask="0x7" values="TC_EVCTRL__EVACT"/>
          <bitfield name="TCINV" caption="TC Event Input Polarity" mask="0x10"/>
          <bitfield name="TCEI" caption="TC Event Enable" mask="0x20"/>
          <bitfield name="OVFEO" caption="Event Output Enable" mask="0x100"/>
          <bitfield name="MCEO0" caption="MC Event Output Enable 0" mask="0x1000"/>
          <bitfield name="MCEO1" caption="MC Event Output Enable 1" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="OVF" caption="OVF Interrupt Disable" mask="0x1"/>
          <bitfield name="ERR" caption="ERR Interrupt Disable" mask="0x2"/>
          <bitfield name="MC0" caption="MC Interrupt Disable 0" mask="0x10"/>
          <bitfield name="MC1" caption="MC Interrupt Disable 1" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="OVF" caption="OVF Interrupt Enable" mask="0x1"/>
          <bitfield name="ERR" caption="ERR Interrupt Enable" mask="0x2"/>
          <bitfield name="MC0" caption="MC Interrupt Enable 0" mask="0x10"/>
          <bitfield name="MC1" caption="MC Interrupt Enable 1" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVF" caption="OVF Interrupt Flag" mask="0x1"/>
          <bitfield name="ERR" caption="ERR Interrupt Flag" mask="0x2"/>
          <bitfield name="MC0" caption="MC Interrupt Flag 0" mask="0x10"/>
          <bitfield name="MC1" caption="MC Interrupt Flag 1" mask="0x20"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" access="RWSYNC" size="1" initval="0x01" caption="Status">
          <bitfield name="STOP" caption="Stop Status Flag" mask="0x1"/>
          <bitfield name="SLAVE" caption="Slave Status Flag" mask="0x2"/>
          <bitfield name="PERBUFV" caption="Synchronization Busy Status" mask="0x8"/>
          <bitfield name="CCBUFV0" caption="Compare channel buffer 0 valid" mask="0x10"/>
          <bitfield name="CCBUFV1" caption="Compare channel buffer 1 valid" mask="0x20"/>
        </register>
        <register name="WAVE" offset="0xC" rw="RW" size="1" initval="0x00" caption="Waveform Generation Control">
          <bitfield name="WAVEGEN" caption="Waveform Generation Mode" mask="0x3" values="TC_WAVE__WAVEGEN"/>
        </register>
        <register name="DRVCTRL" offset="0xD" rw="RW" size="1" initval="0x00" caption="Control C">
          <bitfield name="INVEN0" caption="Output Waveform Invert Enable 0" mask="0x1"/>
          <bitfield name="INVEN1" caption="Output Waveform Invert Enable 1" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0xF" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Run During Debug" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Synchronization Status">
          <bitfield name="SWRST" caption="swrst" mask="0x1"/>
          <bitfield name="ENABLE" caption="enable" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB" mask="0x4"/>
          <bitfield name="STATUS" caption="STATUS" mask="0x8"/>
          <bitfield name="COUNT" caption="Counter" mask="0x10"/>
          <bitfield name="PER" caption="Period" mask="0x20"/>
          <bitfield name="CC0" caption="Compare Channel 0" mask="0x40"/>
          <bitfield name="CC1" caption="Compare Channel 1" mask="0x80"/>
        </register>
        <register modes="COUNT8" name="COUNT" offset="0x14" rw="RW" access="RWSYNC" size="1" initval="0x00" caption="COUNT8 Count">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFF"/>
        </register>
        <register modes="COUNT16" name="COUNT" offset="0x14" rw="RW" access="RWSYNC" size="2" initval="0x0000" caption="COUNT16 Count">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
        </register>
        <register modes="COUNT32" name="COUNT" offset="0x14" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="COUNT32 Count">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="COUNT8" name="PER" offset="0x1B" rw="RW" access="WSYNC" size="1" initval="0xFF" caption="COUNT8 Period">
          <bitfield name="PER" caption="Period Value" mask="0xFF"/>
        </register>
        <register modes="COUNT8" name="CC" offset="0x1C" rw="RW" access="RWSYNC" size="1" count="2" initval="0x00" caption="COUNT8 Compare and Capture">
          <bitfield name="CC" caption="Counter/Compare Value" mask="0xFF"/>
        </register>
        <register modes="COUNT16" name="CC" offset="0x1C" rw="RW" access="RWSYNC" size="2" count="2" initval="0x0000" caption="COUNT16 Compare and Capture">
          <bitfield name="CC" caption="Counter/Compare Value" mask="0xFFFF"/>
        </register>
        <register modes="COUNT32" name="CC" offset="0x1C" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="COUNT32 Compare and Capture">
          <bitfield name="CC" caption="Counter/Compare Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="COUNT8" name="PERBUF" offset="0x2F" rw="RW" access="WSYNC" size="1" initval="0xFF" caption="COUNT8 Period Buffer">
          <bitfield name="PERBUF" caption="Period Buffer Value" mask="0xFF"/>
        </register>
        <register modes="COUNT8" name="CCBUF" offset="0x30" rw="RW" access="WSYNC" size="1" count="2" initval="0x00" caption="COUNT8 Compare and Capture Buffer">
          <bitfield name="CCBUF" caption="Counter/Compare Buffer Value" mask="0xFF"/>
        </register>
